# Symbol Type Id KBtu Property

Source: https://www.revitapidocs.com/2026/dd3eb801-37b2-5c85-6e70-2a8d91bbe898.htm

---

| Symbol Type Id KBtu Property |
| --- |

Symbol kBtu, indicating unit Thousand British thermal units.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId KBtu { get; }
```

```
Public Shared ReadOnly Property KBtu As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ KBtu {
	ForgeTypeId^ get ();
}
```

```
static member KBtu : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

SymbolTypeId Class Autodesk.Revit.DB Namespace